/******************************************************************************/
/*!
@file	Routine.h
@brief	Routine <br>
		ルーチン制御です。

@author	Masanari Higuchi
@par	Copyright (C) 2014 Hornet Co., Ltd. All rights reserved.
*/
/******************************************************************************/
#ifndef	__ROUTINE_H__
#define	__ROUTINE_H__

////////////////////////////////////////////////////////////////////////////////
/*!
	ルーチンクラス
*/
class Routine
{
public:
	// ---------------------------------------------------------
	//!@name 初期化
	//!@{

	//! コンストラクタ
	Routine(int max);

	//!@}
	// ---------------------------------------------------------
	//!@name ルーチン制御
	//!@{

	//! ルーチン番号を設定する
	void setNo(int no);

	//! ルーチン番号を取得する
	int getNo() const {return _no;}

	//!@}

public:
	int	_step;
	float _time;

private:
	int	_no;
	int	_noMax;
};

#endif	// __ROUTINE_H__
/******************************************************************************/
//	End Of File
/******************************************************************************/